// Opros_analis.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>
#include <ctime>
#include <cstdlib>
#include <string.h>
#include <list>
using namespace std;


class AnswerKit
{
	static const char* Countries[5];

	static const char* Education[4];
	static const char* Sex[2];
	static const char* Religion[5];
	static const char* Mustache[2];
	static const char* Health[4];
	static const char* Bodytype[3];
	static const char* Orientation[2];
	static const char* Postcode[10];
	static const char* Profession[4];



	static const char* Mainthings[6];
	static const char* Pets[4];

public:
	static const char* GetMainthings(int x);
	static const char* FillСountry(int x);
	static const char* GetPet(int x);
	static const char* Fill(const char* types, int x);
	static int PetSize();
	static int IndexPet(const char* pet);
	static int IndexMainthings(const char* main);
	static int Size(const char* types);

};


const char* AnswerKit::Mainthings[6] = { "Nothing","Fishing","Food","Religion","Beer","Family" };/*bool*/
const char* AnswerKit::Profession[4] = { "Programmer","engineer","scientist","teacher" };
const char* AnswerKit::Postcode[10] = { "8345","9512","312","451","789","5651","8992","0123","1233","5551" };
const char* AnswerKit::Orientation[2] = { "Heterosexual","Super heterosexual" };
const char* AnswerKit::Bodytype[3] = { "Athletic","Thin","Thick" };
const char* AnswerKit::Health[4] = { "Worst","Not good","Good","Excellent" };
const char* AnswerKit::Mustache[2] = { "Yes","No" };
const char* AnswerKit::Religion[5] = { "Christianity","Islam","Buddhism","Judaism","Hinduism" };
const char* AnswerKit::Sex[2] = { "Male","Female" };
const char* AnswerKit::Education[4] = { "Secondary education","Secondary special education","Bachelor","Master" };
const char* AnswerKit::Pets[4] = { "Dog","Cat","Parrot","Nothing" };/*bool*/
const char* AnswerKit::Countries[5] = { "USA","Russia","China","Japan","Canada" };


const char* AnswerKit::Fill(const char* types, int x)
{
	if (strcmp(types, "Profession") == 0)
	{
		return Profession[x];
	}
	else if (strcmp(types, "Postcode") == 0)
	{
		return Postcode[x];
	}
	else if (strcmp(types, "Orientation") == 0)
	{
		return Orientation[x];
	}
	else if (strcmp(types, "Bodytype") == 0)
	{
		return Bodytype[x];
	}
	else if (strcmp(types, "Health") == 0)
	{
		return Health[x];
	}
	else if (strcmp(types, "Mustache") == 0)
	{
		return Mustache[x];
	}
	else if (strcmp(types, "Religion") == 0)
	{
		return Religion[x];
	}
	else if (strcmp(types, "Sex") == 0)
	{
		return Sex[x];
	}
	else if (strcmp(types, "Education") == 0)
	{
		return Education[x];
	}
}

const char* AnswerKit::FillСountry(int x)
{
	return Countries[x];
}



int AnswerKit::PetSize()
{
	return 4;
}

int AnswerKit::Size(const char* types)
{
	if (strcmp(types, "Profession") == 0)
	{
		return 4;
	}
	else if (strcmp(types, "Postcode") == 0)
	{
		return 10;
	}
	else if (strcmp(types, "Orientation") == 0)
	{
		return 2;
	}
	else if (strcmp(types, "Bodytype") == 0)
	{
		return 3;
	}
	else if (strcmp(types, "Health") == 0)
	{
		return 4;
	}
	else if (strcmp(types, "Mustache") == 0)
	{
		return 2;
	}
	else if (strcmp(types, "Religion") == 0)
	{
		return 5;
	}
	else if (strcmp(types, "Sex") == 0)
	{
		return 2;
	}
	else if (strcmp(types, "Education") == 0)
	{
		return 4;
	}
	else if (strcmp(types, "Mainthings") == 0)
	{
		return 6;
	}


}

int AnswerKit::IndexPet(const char* pet)
{
	for (int i = 0; i < PetSize(); i++)
	{
		if (strcmp(Pets[i], pet) == 0)
		{
			return i;
		}
	}
	return 3;
}

int AnswerKit::IndexMainthings(const char* main)
{
	for (int i = 0; i < AnswerKit::Size("Mainthings"); i++)
	{
		if (strcmp(Mainthings[i], main) == 0)
		{
			return i;
		}
	}
	return 3;
}

const char* AnswerKit::GetPet(int x)
{
	return Pets[x];
}

const char* AnswerKit::GetMainthings(int x)
{
	return Mainthings[x];
}



class Form
{
	struct Questre
	{
		int old;/*1+*/
		int salary;/*2+*/
		int happy; /*3*/
		int work_experience;/*4*/
		int workOurs;/*5*/
		int workdays;/*6*/
		int happycountry;

		const char* country;/*7*/
		const char* education;/*8*/
		const char* sex;/*9*/
		const char* religion;/*10*/
		const char* mustache;/*11*/
		const char* wantlive;/*12*/
		const char* health;/*13*/
		const char* postcode;/*15*/
		const char* bodytype;/*16*/
		const char* orientation;/*17*/
		const char* profession;

		bool mainthings[5];/*19*/
		bool pets[4];/*20*/
	};
	Questre* ptrQuest;

public:
	static Form* Create();

	bool* GetPets();
	bool* GetMainthings();
	int GetOld();

	int GetSalary() { return ptrQuest->salary; }
	int GetHappy() { return ptrQuest->happy; }
	int GetWork_experience() { return ptrQuest->work_experience; }
	int GetWorkOurs() { return ptrQuest->workOurs; }
	int GetWorkdays() { return ptrQuest->workdays; }
	int GetHappycountry() { return ptrQuest->happycountry; }



	const char* GetCountry();
	const char* GetProfession() { return ptrQuest->profession; }
	const char* GetSex() { return ptrQuest->sex; }
	const char* GetReligion() { return ptrQuest->religion; }
	const char* GetMustache() { return ptrQuest->mustache; }
	const char* GetWantlive() { return ptrQuest->wantlive; }
	const char* GetHealth() { return ptrQuest->health; }
	const char* GetPostcode() { return ptrQuest->postcode; }
	const char* GetBodytype() { return ptrQuest->bodytype; }
	const char* GetOrientation() { return ptrQuest->orientation; }
